uhnp/src/Documents/Элиминация/Элиминация.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Элиминация</name>
  <registerRecords>AccountingRegister.МСФО</registerRecords>
  <attributes>
    <name>Сценарий</name>
    <type>
      <types>CatalogRef.Сценарии</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодОтчета</name>
    <type>
      <types>CatalogRef.Периоды</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Удалить_ПериметрДляЭлиминации</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Удалить_ВалютаЭлиминационныхПроводок</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
</mdclass:Document>

uhnp/src/InformationRegisters/СтатусыПериодовСценариев/СтатусыПериодовСценариев.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусыПериодовСценариев</name>
  <resources>
    <name>СтатусПоказателя</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтатусБлокировки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаЗакрытияПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВерсияРегламента</name>
    <type>
      <types>CatalogRef.ВерсииРегламентовПодготовкиОтчетности</types>
    </type>
  </resources>
  <attributes>
    <name>УправлениеПериодомСценария</name>
    <type>
      <types>DocumentRef.УправлениеПериодомСценария</types>
    </type>
  </attributes>
  <dimensions>
    <name>Сценарии</name>
    <type>
      <types>CatalogRef.Сценарии</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Периоды</name>
    <type>
      <types>CatalogRef.Периоды</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организации</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УдалитьПроекты</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/InformationRegisters/ЗначенияПоказателейОтчетов6/ЗначенияПоказателейОтчетов6.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗначенияПоказателейОтчетов6</name>
  <resources>
    <name>Значение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗначениеВалюта</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ИтоговоеЗначение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПравилоОбработки</name>
    <type>
      <types>CatalogRef.ПравилаОбработки</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуемаяИБ</name>
    <type>
      <types>CatalogRef.ВнешниеИнформационныеБазы</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоследнийРедактировавший</name>
    <comment>Пользователь, внесший последние изменения</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособФормированияОтчета</name>
    <type>
      <types>EnumRef.СпособыФормированияОтчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзмененияMs</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Версия</name>
    <type>
      <types>CatalogRef.ВерсииЗначенийПоказателей</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Показатель</name>
    <type>
      <types>CatalogRef.ПоказателиОтчетов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Аналитика1</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Аналитика2</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Аналитика3</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Аналитика4</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Аналитика5</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Аналитика6</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </dimensions>
  <dimensions>
    <name>АналитикаВалюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/Enums/ТипыТехническихСчетовДляСверкиЭлиминации/ТипыТехническихСчетовДляСверкиЭлиминации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыТехническихСчетовДляСверкиЭлиминации</name>
  <enumValues>
    <name>СчетЭлиминации</name>
  </enumValues>
  <enumValues>
    <name>СчетУрегулирования</name>
  </enumValues>
  <enumValues>
    <name>СчетАвтоматическогоУрегулирования</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Enums/СпособОпределенияНаправленияУчета/СпособОпределенияНаправленияУчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособОпределенияНаправленияУчета</name>
  <enumValues>
    <name>ПоЗнакуОперации</name>
    <comment>Плюс - дебет, минус - кредит</comment>
  </enumValues>
  <enumValues>
    <name>ТолькоДебет</name>
  </enumValues>
  <enumValues>
    <name>ТолькоКредит</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Catalogs/ШаблоныСверкиВГО/ШаблоныСверкиВГО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ШаблоныСверкиВГО</name>
  <attributes>
    <name>БезТрансляции</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаИтогов</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьИспользоватьАналитикуСчетов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОпределятьСебестоимостьПоВидуВыручки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПланСчетовЭлиминации</name>
    <type>
      <types>CatalogRef.ПланыСчетовБД</types>
    </type>
  </attributes>
  <attributes>
    <name>РегистрироватьНулевыеРасхождения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДнейДоОповещенияОРасходениях</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТрансляцияПлановСчетовНаМСФОДляЭлиминации</name>
    <attributes>
      <name>ПланСчетовИсточник</name>
      <type>
        <types>CatalogRef.ПланыСчетовБД</types>
      </type>
    </attributes>
    <attributes>
      <name>ШаблонТрансляцииСчетов</name>
      <type>
        <types>CatalogRef.ШаблоныТрансляций</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТехническиеСчета</name>
    <attributes>
      <name>ТипСчета</name>
      <type>
        <types>EnumRef.ТипыТехническихСчетовДляСверкиЭлиминации</types>
      </type>
    </attributes>
    <attributes>
      <name>Счет</name>
      <type>
        <types>CatalogRef.СчетаБД</types>
      </type>
    </attributes>
    <attributes>
      <name>СпособЗаполненияСубконто1</name>
      <type>
        <types>EnumRef.СпособыЗаполненияЗначенийСубконтоСчета</types>
      </type>
    </attributes>
    <attributes>
      <name>СпособЗаполненияСубконто2</name>
      <type>
        <types>EnumRef.СпособыЗаполненияЗначенийСубконтоСчета</types>
      </type>
    </attributes>
    <attributes>
      <name>СпособЗаполненияСубконто3</name>
      <type>
        <types>EnumRef.СпособыЗаполненияЗначенийСубконтоСчета</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеЗаполненияСубконто1</name>
      <type>
        <types>AnyRef</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеЗаполненияСубконто2</name>
      <type>
        <types>AnyRef</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеЗаполненияСубконто3</name>
      <type>
        <types>AnyRef</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

uhnp/src/Catalogs/ПланыСчетовБД/ПланыСчетовБД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПланыСчетовБД</name>
  <comment>Содержит реквизиты планов счетов текущей и внешних информационных баз, необходимые для настройки выборки</comment>
  <owners>Catalog.ТипыБазДанных</owners>
  <attributes>
    <name>МаксимальноеКоличествоСубконто</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПризнакиУчета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПризнакиУчетаСубконто</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПрефиксДт</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПрефиксКт</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидОтчетаОСВ</name>
    <type>
      <types>CatalogRef.ВидыОтчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетТР</name>
    <type>
      <types>CatalogRef.СчетаБД</types>
    </type>
  </attributes>
  <attributes>
    <name>ДлинаКода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидыСубконто</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидыСубконтоОписание</name>
    <type>
      <types>CatalogRef.ПланыВидовХарактеристикБД</types>
    </type>
  </attributes>
  <attributes>
    <name>ПланСчетовМетаданные</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПланСчетовИсточник</name>
    <type>
      <types>CatalogRef.ПланыСчетовБД</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьОтсутствуетВКонфигурации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСиноним</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>МетаданныеТекущейИБ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтсутствуетВКонфигурации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Синоним</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПланСчетовМСФО</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьРегистрБухгалтерии</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МаскаКода</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Синоним1</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Синоним2</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СчетаИтогов</name>
    <attributes>
      <name>СчетИтога</name>
      <type>
        <types>CatalogRef.СчетаБД</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Реквизиты</name>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Синоним</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипДанных</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ОписаниеПримитивногоТипа</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбщийРеквизит</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Синоним1</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Синоним2</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

uhnp/src/Documents/Элиминация/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Заполняет регистр сведений проводками для элиминации.
//
// Параметры:
//  Ссылка - ДокументСсылка.Элиминация - документ элиминации
//		определяющий ее параметры.
//	флОтладка - Булево - записывать дополнительную
//		информацию в отладочные регистры.
// 
// Возвращаемое значение:
//   - Неопределено - если заполнение прошло успешно.
//	 - Массив(ОписаниеОшибки) - см. описание функции
//			ПротоколируемыеСобытияУХ.ПолучитьМассивПротоколируемыхОбъектов.
//
Функция ЗаполнитьРегистрПроводокДляЭлиминации(Ссылка, флОтладка=Ложь) Экспорт
	
	ПротоколируемыеСобытияУХ.Начать(Ссылка);
	
	СтруктураПараметров = ЭлиминацияВГОУХ.ПолучитьПустыеПараметрыЭлиминации();
	ЗаполнитьЗначенияСвойств(СтруктураПараметров, Ссылка);
	СтруктураПараметров.ДокументЭлиминации = Ссылка;
	СтруктураПараметров.Консолидирующая = УправлениеРабочимиПроцессамиУХ.ПолучитьКонсолидирующуюОрганизацию(
		СтруктураПараметров.Организация, СтруктураПараметров.Сценарий, СтруктураПараметров.ПериодОтчета);
	Если флОтладка Тогда
		СтруктураПараметров.Вставить("Отладка", Истина);
	КонецЕсли;
	
	ЭлиминацияВГОУХ.ЗаполнитьРегистрПроводкиДляЭлиминации(СтруктураПараметров);
	
	ПротоколОшибок=ПротоколируемыеСобытияУХ.Завершить(
		"Документ.Элиминация",, Ссылка);
	ПротоколируемыеСобытияУХ.ЗаписатьПротоколВРегистр(
		Ссылка,,ПротоколОшибок,, Ссылка.ПериодОтчета, Ссылка.Сценарий);
		
	Если ПротоколируемыеСобытияУХ.ЕстьПротоколыПоОбъекту(
				Ссылка,, Ссылка.ПериодОтчета, Ссылка.Сценарий) Тогда
		МассивОбъекта = Новый Массив();
		МассивОбъекта.Добавить(Ссылка);
		Возврат ПротоколируемыеСобытияУХ.ПолучитьМассивПротоколируемыхОбъектов(
					МассивОбъекта);
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

// Возвращает ссылку на документ Элиминация по указанным реквизитам. Когда документ не найден -
// возвращает пустую ссылку.
Функция ПолучитьЭкземплярЭлиминации(ПериодВход, ОрганизацияВход, СценарийВход, ВалютаВход = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ ПЕРВЫЕ 1
	|	Элиминация.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.Элиминация КАК Элиминация
	|ГДЕ
	|	НЕ Элиминация.ПометкаУдаления
	|	И Элиминация.Сценарий = &Сценарий
	|	И Элиминация.ПериодОтчета = &ПериодОтчета
	|	И Элиминация.Организация = &Организация";
	
	Запрос.УстановитьПараметр("Организация", 	ОрганизацияВход);
	Запрос.УстановитьПараметр("ПериодОтчета",	ПериодВход);
	Запрос.УстановитьПараметр("Сценарий", 		СценарийВход);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Документы.Элиминация.ПустаяСсылка();	
	КонецЕсли;
	
	Возврат РезультатЗапроса.Выгрузить().Получить(0).Получить(0);
	
КонецФункции

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область Проведение

Функция ПодготовитьПараметрыПроведения(ДополнительныеСвойства, Отказ, ФормироватьПроводкиМСФО = Неопределено) Экспорт

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ссылка", ДополнительныеСвойства.ДляПроведения.Ссылка);
	
	ЗаполнитьПараметрыЗапроса(Запрос, Отказ);
	
	Если Отказ Тогда
		Возврат ДополнительныеСвойства;
	КонецЕсли;
	
	НомераТаблиц = Новый Структура;
	ТекстЗапроса = Новый Массив;
	
	ТекстЗапроса.Добавить(ТекстЗапроса_втВидыСубконтоНСБУ(НомераТаблиц));
	ТекстЗапроса.Добавить(ТекстЗапроса_втВидыСубконто(НомераТаблиц));
	ТекстЗапроса.Добавить(ТекстЗапроса_РегистраторыИсключения(НомераТаблиц));
	ТекстЗапроса.Добавить(ТекстЗапроса_втРегламенты(НомераТаблиц));
	ТекстЗапроса.Добавить(ТекстЗапроса_втРазделыВГО(НомераТаблиц));
	ТекстЗапроса.Добавить(ТекстЗапроса_втИдРазделовВГО(НомераТаблиц));
	
	#Область ПолучениеЗПО
	ТекстЗапроса.Добавить(ТекстЗапроса_втПоказателиРазделовВГО(НомераТаблиц)); 
	ТекстЗапроса.Добавить(ТекстЗапроса_втПоказатели(НомераТаблиц));
	ТекстЗапроса.Добавить(ТекстЗапроса_втВерсии(НомераТаблиц));
	ТекстЗапроса.Добавить(ТекстЗапроса_втЗначенияПоказателейБезСубконто(НомераТаблиц));
	ТекстЗапроса.Добавить(ТекстЗапроса_втЗначенияПоказателей(НомераТаблиц));
	#КонецОбласти
	
	#Область Маржа
	ТекстЗапроса.Добавить(ТекстЗапроса_втСебестоимость(НомераТаблиц));
	ТекстЗапроса.Добавить(ТекстЗапроса_втМаржа(НомераТаблиц));
	#КонецОбласти
	
	#Область Трансляция
	ТекстЗапроса.Добавить(ТекстЗапроса_втСчетаПоказателей(НомераТаблиц));
	ДобавитьЗапросы_втОборотыТрансляции(ТекстЗапроса, НомераТаблиц, Запрос);
	#КонецОбласти
	
	#Область Движения
	ТекстЗапроса.Добавить(ТекстЗапроса_Проводки(НомераТаблиц, Запрос.Параметры.ФормироватьПроводкиМСФО));
	//** ошибки
	//** элимПок
	#КонецОбласти
	
	ТекстРазделителя = ОбщегоНазначенияУХВызовСервера.ТекстРазделителяЗапросовПакета();
	Запрос.Текст = СтрСоединить(ТекстЗапроса, ТекстРазделителя);
	Возврат ПолучитьПараметрыПроведения(ДополнительныеСвойства, Запрос, НомераТаблиц);
		
КонецФункции

Процедура ЗаполнитьПараметрыЗапроса(Запрос, Отказ)
	
	Ссылка = Запрос.Параметры.Ссылка;
	ИменаДопРеквизитов = "ПериодОтчета, ДатаНачала, ДатаОкончания, ВидОтчета";
	Реквизиты = МСФОУХ.РеквизитыДокумента(Запрос, ИменаДопРеквизитов, "ПериодОтчета", Отказ);
	
	Отбор = Новый Соответствие;
	Отбор.Вставить("Организация", 			Реквизиты.Организация);
	Отбор.Вставить("Сценарий", 				Реквизиты.Сценарий);
	Отбор.Вставить("ПериодОтчета", 			Реквизиты.ПериодОтчета);
	Отбор.Вставить("ЭффективнаяДоляРасчет", 100);//** только ВГО
	
	ПоляВыборки = Новый Структура("ЭффективнаяДоляРасчет, ВерсияРегламента");
	Периметр = УправлениеРабочимиПроцессамиУХ.ПолучитьДанныеРегламента(Отбор, ПоляВыборки);
	Если Периметр.Количество() = 0 Тогда
		Сообщение = НСтр("ru = 'Не удалось определить организации периметра для элиминации по периоду и сценарию'");
		СообщитьПользователю(Сообщение, Ссылка, Отказ);
	КонецЕсли;
	
	ТабПериметр = Неопределено;
	//Орг,ШаблонТрансляции,ФВ,УП,Курсы

	ШаблонВГО = ПредопределенноеЗначение("Справочник.ШаблоныСверкиВГО.ПустаяСсылка");
	Если Периметр.Количество() Тогда
		ШаблонВГО = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Периметр[0].ВерсияРегламента, "ШаблонСверкиВГО");
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Организация",		Реквизиты.Организация);
	Запрос.УстановитьПараметр("Сценарий",			Реквизиты.Сценарий);
	Запрос.УстановитьПараметр("ПериодОтчета",		Реквизиты.ПериодОтчета);
	
	Запрос.УстановитьПараметр("ПланСчетовМСФО",			Реквизиты.ПланСчетовМСФО);
	Запрос.УстановитьПараметр("ВидОтчета",				Реквизиты.ВидОтчета);
	Запрос.УстановитьПараметр("ФункциональнаяВалюта",	Реквизиты.ФункциональнаяВалюта);
	Запрос.УстановитьПараметр("ВалютаПредставления",	Реквизиты.ВалютаПредставления);
	Запрос.УстановитьПараметр("УчетнаяПолитика",		Реквизиты.УчетнаяПолитика); // для фикс. счетов
	
	Запрос.УстановитьПараметр("ОрганизацииПериметра",	Периметр.ВыгрузитьКолонку("ИндивидуальнаяОрганизация"));
	
	Запрос.УстановитьПараметр("РежимОтладки",			ОбщегоНазначения.РежимОтладки());
	Запрос.УстановитьПараметр("ШаблонВГО",				ШаблонВГО);
	Запрос.УстановитьПараметр("ШаблонТрансляции",		ШаблонВГО.ТрансляцияПлановСчетовНаМСФОДляЭлиминации.ВыгрузитьКолонку("ШаблонТрансляцииСчетов"));
	
	//Запрос.УстановитьПараметр("ОрганизацияКонсолидирующая",	Реквизиты.КонсолидирующаяОрганизация);
	//Запрос.УстановитьПараметр("ВалютаОтчетности",			Реквизиты.ВалютаПредставления);
	//Запрос.УстановитьПараметр("ДатаОкончанияПериода",		Реквизиты.ДатаОкончания);

КонецПроцедуры

Процедура СообщитьПользователю(ТекстСообщения, Ссылка, Отказ = Ложь)
	
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Ссылка,,, Отказ);	

КонецПроцедуры

Функция ПолучитьПараметрыПроведения(ДополнительныеСвойства, Запрос, НомераТаблиц)
	
	ДополнительныеСвойства.ДляПроведения.Вставить("Реквизиты", Запрос.Параметры);
	Если Запрос.Параметры.РежимОтладки Тогда
		ДополнительныеСвойства.ДляПроведения.Вставить(
			"МенеджерВременныхТаблиц", Запрос.МенеджерВременныхТаблиц);
	КонецЕсли;
	
	ПроведениеСерверУХ.ДополнитьТаблицамиИзПакетаЗапросов(
		ДополнительныеСвойства.ТаблицыДляДвижений, Запрос, НомераТаблиц);
	
	Возврат ДополнительныеСвойства;

КонецФункции

#Область ДляУдаления

Функция ТекстЗапроса_Поместить(НомераТаблиц, ИмяТаблицы, ТекстЗапросаДляПомещения, ДопПоля = Неопределено)

	НомераТаблиц.Вставить(ИмяТаблицы, НомераТаблиц.Количество());
	
	ТекстЗапроса = 
	"ВЫБРАТЬ 
	|	%1, 
	|	* 
	|ПОМЕСТИТЬ %2 
	|ИЗ 
	|	(%3) КАК %2";
	
	ДопПоля = ?(ЗначениеЗаполнено(ДопПоля), ДопПоля, "NULL");
	Возврат СтрШаблон(ТекстЗапроса, ДопПоля, ИмяТаблицы, ТекстЗапросаДляПомещения);
	
КонецФункции

#КонецОбласти

#Область втВидыСубконто

Функция ТекстЗапроса_втВидыСубконтоНСБУ(НомераТаблиц)
	
	НомераТаблиц.Вставить("втВидыСубконтоНСБУ", НомераТаблиц.Количество());
	
	Возврат 
	"ВЫБРАТЬ
	|	тчВидыСубконто.ВидСубконтоСсылка КАК Ссылка,
	|	МАКСИМУМ(ВЫРАЗИТЬ(тчВидыСубконто.ТипДанных КАК СТРОКА(150))) КАК ПредставлениеТипа
	|ПОМЕСТИТЬ втВидыСубконтоНСБУ
	|ИЗ
	|	Справочник.ПланыСчетовБД КАК ПланыСчетовБД
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СчетаБД КАК СчетаБД
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СчетаБД.ВидыСубконто КАК тчВидыСубконто
	|			ПО СчетаБД.Ссылка = тчВидыСубконто.Ссылка
	|		ПО ПланыСчетовБД.Ссылка = СчетаБД.Владелец
	|ГДЕ
	|	НЕ ПланыСчетовБД.ОтсутствуетВКонфигурации
	|	И НЕ ПланыСчетовБД.ПланСчетовМСФО
	|
	|СГРУППИРОВАТЬ ПО
	|	тчВидыСубконто.ВидСубконтоСсылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ПредставлениеТипа";
	
КонецФункции

Функция ТекстЗапроса_втВидыСубконто(НомераТаблиц)
	
	НомераТаблиц.Вставить("втВидыСубконто", НомераТаблиц.Количество());
	
	РолиПВХ = Новый Соответствие;
	РолиПВХ.Вставить("%Справочник.Организации%", 				"ОрганизацияКонтрагент");
	РолиПВХ.Вставить("%Справочник.Контрагенты%", 				"Контрагент");
	РолиПВХ.Вставить("%Справочник.ВидыВыручкиВГО%", 			"ВидВыручкиВГО");
	РолиПВХ.Вставить("%Справочник.НоменклатурныеГруппы%", 		"ВидВыручкиВГО");
	РолиПВХ.Вставить("%Справочник.РазделыСверкиВГО%", 			"РазделВГО");
	РолиПВХ.Вставить("%Справочник.СчетаБД%", 					"СчетБД");
	РолиПВХ.Вставить("%Справочник.ПодразделенияОрганизаций%", 	"Подразделение");
	РолиПВХ.Вставить("%Справочник.НаправленияДеятельности%", 	"НаправлениеДеятельности");
	РолиПВХ.Вставить("%Справочник.ПоказателиОтчетов%", 			"ПоказательОтчета");
	
	ШаблонРоли = Шаблон_РольСубконто();
    
	ТекстЗапроса = Новый Массив;
	Для каждого рольПВХ Из РолиПВХ Цикл
		ТекстЗапроса.Добавить(СтрШаблон(ШаблонРоли, рольПВХ.Ключ, рольПВХ.Значение));
	КонецЦикла;
	
	ТекстТаблица = "(" + СтрСоединить(ТекстЗапроса, " ОБЪЕДИНИТЬ ВСЕ ") + ")";
	Возврат СтрЗаменить(Шаблон_втВидыСубконто(), "ТаблицаВидыСубконто", ТекстТаблица);

КонецФункции

Функция Шаблон_РольСубконто()

	Возврат
	"ВЫБРАТЬ
	|	""%2"" КАК Роль,
	|	ВЫРАЗИТЬ(т.ПредставлениеТипа КАК СТРОКА(150)) КАК ПредставлениеТипа,
	|	т.Ссылка КАК ВидСубконто
	|ИЗ
	|	ПланВидовХарактеристик.ВидыСубконтоКорпоративные КАК т
	|ГДЕ
	|	т.ПредставлениеТипа ПОДОБНО ""%1""
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""%2"",
	|	ВЫРАЗИТЬ(т.ПредставлениеТипа КАК СТРОКА(150)),
	|	т.Ссылка
	|ИЗ
	|	втВидыСубконтоНСБУ КАК т
	|ГДЕ
	|	т.ПредставлениеТипа ПОДОБНО ""%1""";

КонецФункции

Функция Шаблон_втВидыСубконто()
	
	Возврат
	"ВЫБРАТЬ
	|	МАКСИМУМ(вт.Роль) КАК Роль,
	|	МАКСИМУМ(вт.ВидСубконто.Код) КАК Приоритет,
	|	МАКСИМУМ(вт.ПредставлениеТипа) КАК ПредставлениеТипа,
	|	КОЛИЧЕСТВО(вт.ВидСубконто) КАК ДублиРолей,
	|	вт.ВидСубконто КАК ВидСубконто
	|ПОМЕСТИТЬ втВидыСубконто
	|ИЗ
	|	ТаблицаВидыСубконто КАК вт
	|
	|СГРУППИРОВАТЬ ПО
	|	вт.ВидСубконто
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ВидСубконто";

КонецФункции

#КонецОбласти

#Область ШаблонВГО

Функция ТекстЗапроса_втРегламенты(НомераТаблиц)

	НомераТаблиц.Вставить("втРегламенты", НомераТаблиц.Количество());
	
	//**Документы.УчетнаяПолитикаМСФО.ЗаменитьФиксированныеСчетаУчетаБД(Запрос.Текст);

	Возврат 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	т.УправлениеПериодомСценария КАК УОП,
	|	т.Периоды КАК ПериодСценария,
	|	т.Сценарии КАК Сценарий,
	|	т.ВерсияРегламента КАК Регламент,
	|	т.ВерсияРегламента.ШаблонСверкиВГО КАК ШаблонСверкиВГО,
	|	т.ВерсияРегламента.ШаблонСверкиВГО.ВалютаИтогов КАК ВалютаВГО,
	|	Вид1.ВидСубконтоСсылка КАК ВидСубконто1,
	|	Вид2.ВидСубконтоСсылка КАК ВидСубконто2,
	|	Вид3.ВидСубконтоСсылка КАК ВидСубконто3,
	|	Роль1.Роль КАК Роль1,
	|	Роль2.Роль КАК Роль2,
	|	Роль3.Роль КАК Роль3,
	|	ТехСчет.ЗначениеЗаполненияСубконто1 КАК Субконто1,
	|	ТехСчет.ЗначениеЗаполненияСубконто2 КАК Субконто2,
	|	ТехСчет.ЗначениеЗаполненияСубконто3 КАК Субконто3,
	|	ТехСчет.Счет КАК Счет
	|ПОМЕСТИТЬ втРегламенты
	|ИЗ
	|	РегистрСведений.СтатусыПериодовСценариев КАК т
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ШаблоныСверкиВГО.ТехническиеСчета КАК ТехСчет
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СчетаБД.ВидыСубконто КАК Вид1
	|			ПО ТехСчет.Счет = Вид1.Ссылка
	|				И (Вид1.НомерСтроки = 1)
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СчетаБД.ВидыСубконто КАК Вид2
	|			ПО ТехСчет.Счет = Вид2.Ссылка
	|				И (Вид2.НомерСтроки = 2)
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СчетаБД.ВидыСубконто КАК Вид3
	|			ПО ТехСчет.Счет = Вид3.Ссылка
	|				И (Вид3.НомерСтроки = 3)
	|			ЛЕВОЕ СОЕДИНЕНИЕ втВидыСубконто КАК Роль1
	|			ПО (Вид1.ВидСубконтоСсылка = Роль1.ВидСубконто)
	|			ЛЕВОЕ СОЕДИНЕНИЕ втВидыСубконто КАК Роль2
	|			ПО (Вид2.ВидСубконтоСсылка = Роль2.ВидСубконто)
	|			ЛЕВОЕ СОЕДИНЕНИЕ втВидыСубконто КАК Роль3
	|			ПО (Вид3.ВидСубконтоСсылка = Роль3.ВидСубконто)
	|		ПО т.ВерсияРегламента.ШаблонСверкиВГО = ТехСчет.Ссылка
	|			И (ТехСчет.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыТехническихСчетовДляСверкиЭлиминации.СчетЭлиминации))
	|ГДЕ
	|	т.Периоды В ИЕРАРХИИ(&ПериодОтчета)
	|	И т.Сценарии = &Сценарий";		

КонецФункции

Функция ТекстЗапроса_втРазделыВГО(НомераТаблиц)

	НомераТаблиц.Вставить("втРазделыВГО", НомераТаблиц.Количество());	
	
	Возврат
	"ВЫБРАТЬ
	|	т.Ссылка КАК РазделВГО,
	|	т.ПорогСущественности КАК ПорогСущественности,
	|	т.ВидЗначения КАК ВидКурса,
	|	т.ИсточникДанныхФСДЗакупки КАК ИдЗакупкиПокупателя,
	|	т.ИсточникДанныхФСДСебестоимостьПродаж КАК ИдСебестоимостьПродавца,
	|	т.ИсточникДанныхФСДСебестоимостьПродаж <> ЗНАЧЕНИЕ(Справочник.ИсточникиДанныхДляРасчетов.ПустаяСсылка) КАК ЕстьЗапасы,
	|	т.ГруппаРаскрытия КАК ГруппаРаскрытия
	|ПОМЕСТИТЬ втРазделыВГО
	|ИЗ
	|	Справочник.РазделыСверкиВГО КАК т
	|ГДЕ
	|	НЕ т.ПометкаУдаления
	|	И т.Владелец В
	|			(ВЫБРАТЬ
	|				т.ШаблонСверкиВГО
	|			ИЗ
	|				втРегламенты КАК т)";
	
КонецФункции  

#КонецОбласти

#Область ПоказателиЗПО

Функция ТекстЗапроса_втИдРазделовВГО(НомераТаблиц)

	//РазделыСверкиВГО.ИсточникиДанных.ИсточникДанных
	//ИсточникДанныхФСДЗакупки
	//ИсточникДанныхФСДСебестоимостьПродаж

	НомераТаблиц.Вставить("втИдРазделовВГО", НомераТаблиц.Количество());
	
	Возврат
	"ВЫБРАТЬ
	|	втРазделыВГО.РазделВГО КАК РазделВГО,
	|	т.СпособОпределенияНаправленияУчета = ЗНАЧЕНИЕ(Перечисление.СпособОпределенияНаправленияУчета.ТолькоКредит)
	|		ИЛИ НЕ ПоЗнакуОперации.Дебитор КАК ЭтоПродавец,
	|	т.СпособОпределенияНаправленияУчета = ЗНАЧЕНИЕ(Перечисление.СпособОпределенияНаправленияУчета.ТолькоДебет)
	|		ИЛИ ПоЗнакуОперации.Дебитор КАК ЭтоПокупатель,
	|	ЛОЖЬ КАК ЭтоСебестоимостьПродавца,
	|	ЛОЖЬ КАК ЭтоЗапасыПокупателя,
	|	т.ИсточникДанных.Код КАК КодИД,
	|	т.ИсточникДанных.ГруппаРаскрытияОтбор КАК ГруппаРаскрытияОтбор,
	|	т.ИсточникДанных КАК ИсточникДанных
	|ПОМЕСТИТЬ втИдРазделовВГО
	|ИЗ
	|	Справочник.РазделыСверкиВГО.ИсточникиДанных КАК т
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втРазделыВГО КАК втРазделыВГО
	|		ПО т.Ссылка = втРазделыВГО.РазделВГО
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ИСТИНА КАК Дебитор
	|		
	|		ОБЪЕДИНИТЬ ВСЕ
	|		
	|		ВЫБРАТЬ
	|			ЛОЖЬ) КАК ПоЗнакуОперации
	|		ПО (т.СпособОпределенияНаправленияУчета = ЗНАЧЕНИЕ(Перечисление.СпособОпределенияНаправленияУчета.ПоЗнакуОперации))
	|ГДЕ
	|	ВЫБОР
	|			КОГДА втРазделыВГО.ЕстьЗапасы
	|				ТОГДА НЕ(т.СпособОпределенияНаправленияУчета = ЗНАЧЕНИЕ(Перечисление.СпособОпределенияНаправленияУчета.ТолькоДебет)
	|							ИЛИ ПоЗнакуОперации.Дебитор)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	т.РазделВГО,
	|	ЛОЖЬ,
	|	ЛОЖЬ,
	|	ИСТИНА,
	|	ЛОЖЬ,
	|	т.ИдСебестоимостьПродавца.Код,
	|	т.ИдСебестоимостьПродавца.ГруппаРаскрытияОтбор КАК ГруппаРаскрытия,
	|	т.ИдСебестоимостьПродавца
	|ИЗ
	|	втРазделыВГО КАК т
	|ГДЕ
	|	т.ЕстьЗапасы
	|	И т.ИдСебестоимостьПродавца <> ЗНАЧЕНИЕ(Справочник.ИсточникиДанныхДляРасчетов.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	т.РазделВГО,
	|	ЛОЖЬ,
	|	ЛОЖЬ,
	|	ЛОЖЬ,
	|	ИСТИНА,
	|	т.ИдЗакупкиПокупателя.Код,
	|	т.ИдЗакупкиПокупателя.ГруппаРаскрытияОтбор КАК ГруппаРаскрытия,
	|	т.ИдЗакупкиПокупателя
	|ИЗ
	|	втРазделыВГО КАК т
	|ГДЕ
	|	т.ЕстьЗапасы
	|	И т.ИдЗакупкиПокупателя <> ЗНАЧЕНИЕ(Справочник.ИсточникиДанныхДляРасчетов.ПустаяСсылка)";
	
КонецФункции

Функция ТекстЗапроса_втПоказателиРазделовВГО(НомераТаблиц)
	
	НомераТаблиц.Вставить("втПоказателиРазделовВГО", НомераТаблиц.Количество());
    	
	Возврат
	"ВЫБРАТЬ
	|	втИдРазделовВГО.РазделВГО КАК РазделВГО,
	|	втИдРазделовВГО.ГруппаРаскрытияОтбор КАК ГруппаРаскрытияОтбор,
	|	втИдРазделовВГО.ИсточникДанных КАК ИсточникДанных,
	|	втИдРазделовВГО.ЭтоПродавец КАК ЭтоПродавец,
	|	втИдРазделовВГО.ЭтоПокупатель КАК ЭтоПокупатель,
	|	втИдРазделовВГО.ЭтоСебестоимостьПродавца КАК ЭтоСебестоимостьПродавца,
	|	втИдРазделовВГО.ЭтоЗапасыПокупателя КАК ЭтоЗапасыПокупателя,
	|	ВЫБОР ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоКорпоративные.ПустаяСсылка)
	|		КОГДА втИдРазделовВГО.ГруппаРаскрытияОтбор.ВидАналитики1
	|			ТОГДА 0
	|		КОГДА втИдРазделовВГО.ГруппаРаскрытияОтбор.ВидАналитики2
	|			ТОГДА 1
	|		КОГДА втИдРазделовВГО.ГруппаРаскрытияОтбор.ВидАналитики3
	|			ТОГДА 2
	|		КОГДА втИдРазделовВГО.ГруппаРаскрытияОтбор.ВидАналитики4
	|			ТОГДА 3
	|		КОГДА втИдРазделовВГО.ГруппаРаскрытияОтбор.ВидАналитики5
	|			ТОГДА 4
	|		КОГДА втИдРазделовВГО.ГруппаРаскрытияОтбор.ВидАналитики6
	|			ТОГДА 5
	|		ИНАЧЕ 6
	|	КОНЕЦ КАК НомерРегистра,
	|	Вид1.Роль КАК Роль1,
	|	Вид2.Роль КАК Роль2,
	|	Вид3.Роль КАК Роль3,
	|	Вид4.Роль КАК Роль4,
	|	Вид5.Роль КАК Роль5,
	|	Вид6.Роль КАК Роль6,	
	|	Вид1.ПредставлениеТипа КАК ПредставлениеТипа1,
	|	Вид2.ПредставлениеТипа КАК ПредставлениеТипа2,
	|	Вид3.ПредставлениеТипа КАК ПредставлениеТипа3,
	|	Вид4.ПредставлениеТипа КАК ПредставлениеТипа4,
	|	Вид5.ПредставлениеТипа КАК ПредставлениеТипа5,
	|	Вид6.ПредставлениеТипа КАК ПредставлениеТипа6,
	|	втИдРазделовВГО.ГруппаРаскрытияОтбор.ВидАналитики1 КАК ВидАналитики1,
	|	втИдРазделовВГО.ГруппаРаскрытияОтбор.ВидАналитики2 КАК ВидАналитики2,
	|	втИдРазделовВГО.ГруппаРаскрытияОтбор.ВидАналитики3 КАК ВидАналитики3,
	|	втИдРазделовВГО.ГруппаРаскрытияОтбор.ВидАналитики4 КАК ВидАналитики4,
	|	втИдРазделовВГО.ГруппаРаскрытияОтбор.ВидАналитики5 КАК ВидАналитики5,
	|	втИдРазделовВГО.ГруппаРаскрытияОтбор.ВидАналитики6 КАК ВидАналитики6,
	|	ПоказателиОтчетов.Владелец КАК ВидОтчета,
	|	ПоказателиОтчетов.Ссылка КАК Показатель
	|ПОМЕСТИТЬ втПоказателиРазделовВГО
	|ИЗ
	|	втИдРазделовВГО КАК втИдРазделовВГО
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПоказателиОтчетов КАК ПоказателиОтчетов
	|		ПО втИдРазделовВГО.ГруппаРаскрытияОтбор = ПоказателиОтчетов.ГруппаРаскрытия
	|		ЛЕВОЕ СОЕДИНЕНИЕ втВидыСубконто КАК Вид1
	|		ПО (ПоказателиОтчетов.ГруппаРаскрытия.ВидАналитики1 = Вид1.ВидСубконто)
	|		ЛЕВОЕ СОЕДИНЕНИЕ втВидыСубконто КАК Вид2
	|		ПО (ПоказателиОтчетов.ГруппаРаскрытия.ВидАналитики2 = Вид2.ВидСубконто)
	|		ЛЕВОЕ СОЕДИНЕНИЕ втВидыСубконто КАК Вид3
	|		ПО (ПоказателиОтчетов.ГруппаРаскрытия.ВидАналитики3 = Вид3.ВидСубконто)
	|		ЛЕВОЕ СОЕДИНЕНИЕ втВидыСубконто КАК Вид4
	|		ПО (ПоказателиОтчетов.ГруппаРаскрытия.ВидАналитики4 = Вид4.ВидСубконто)
	|		ЛЕВОЕ СОЕДИНЕНИЕ втВидыСубконто КАК Вид5
	|		ПО (ПоказателиОтчетов.ГруппаРаскрытия.ВидАналитики5 = Вид5.ВидСубконто)
	|		ЛЕВОЕ СОЕДИНЕНИЕ втВидыСубконто КАК Вид6
	|		ПО (ПоказателиОтчетов.ГруппаРаскрытия.ВидАналитики6 = Вид6.ВидСубконто)
	|ГДЕ
	|	втИдРазделовВГО.ГруппаРаскрытияОтбор <> ЗНАЧЕНИЕ(Справочник.ГруппыРаскрытия.ПустаяСсылка)
	|	И ПоказателиОтчетов.Код В
	|			(ВЫБРАТЬ
	|				т.Поле КАК КодПоказателя
	|			ИЗ
	|				Справочник.ИсточникиДанныхДляРасчетов.ПравилаИспользованияПолейЗапроса КАК т
	|			ГДЕ
	|				т.Ссылка = втИдРазделовВГО.ИсточникДанных
	|				И т.АналитикаОперанда = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоКорпоративные.ПустаяСсылка))
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Показатель,
	|	ЭтоПокупатель";

КонецФункции

Функция ТекстЗапроса_втПоказатели(НомераТаблиц)

	НомераТаблиц.Вставить("втПоказатели", НомераТаблиц.Количество());

	Возврат
	"ВЫБРАТЬ
	|	т.Показатель КАК Показатель,
	|	МАКСИМУМ(т.НомерРегистра) КАК НомерРегистра,
	|	МАКСИМУМ(т.Роль1) КАК Роль1,
	|	МАКСИМУМ(т.Роль2) КАК Роль2,
	|	МАКСИМУМ(т.Роль3) КАК Роль3,
	|	МАКСИМУМ(т.Роль4) КАК Роль4,
	|	МАКСИМУМ(т.Роль5) КАК Роль5,
	|	МАКСИМУМ(т.Роль6) КАК Роль6,
	|	МАКСИМУМ(т.ПредставлениеТипа1) КАК ПредставлениеТипа1,
	|	МАКСИМУМ(т.ПредставлениеТипа2) КАК ПредставлениеТипа2,
	|	МАКСИМУМ(т.ПредставлениеТипа3) КАК ПредставлениеТипа3,
	|	МАКСИМУМ(т.ПредставлениеТипа4) КАК ПредставлениеТипа4,
	|	МАКСИМУМ(т.ПредставлениеТипа5) КАК ПредставлениеТипа5,
	|	МАКСИМУМ(т.ПредставлениеТипа6) КАК ПредставлениеТипа6,
	|	МАКСИМУМ(т.ВидАналитики1) КАК ВидАналитики1,
	|	МАКСИМУМ(т.ВидАналитики2) КАК ВидАналитики2,
	|	МАКСИМУМ(т.ВидАналитики3) КАК ВидАналитики3,
	|	МАКСИМУМ(т.ВидАналитики4) КАК ВидАналитики4,
	|	МАКСИМУМ(т.ВидАналитики5) КАК ВидАналитики5,
	|	МАКСИМУМ(т.ВидАналитики6) КАК ВидАналитики6
	|ПОМЕСТИТЬ втПоказатели
	|ИЗ
	|	втПоказателиРазделовВГО КАК т
	|
	|СГРУППИРОВАТЬ ПО
	|	т.Показатель
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Показатель,
	|	НомерРегистра";

КонецФункции

#КонецОбласти

#Область ЗПО

Функция ТекстЗапроса_РегистраторыИсключения(НомераТаблиц)

	НомераТаблиц.Вставить("РегистраторыИсключения", НомераТаблиц.Количество());
	
	Возврат 
	"ВЫБРАТЬ
	|	т.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ РегистраторыИсключения
	|ИЗ
	|	Документ.ТрансформационнаяКорректировка КАК т
	|ГДЕ
	|	т.Сценарий = &Сценарий
	|	И т.Организация В(&Организация)
	|	И т.ПериодОтчета = &ПериодОтчета
	|	И т.ИсходныйДокумент ССЫЛКА Документ.Элиминация
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка";

КонецФункции

Функция ТекстЗапроса_втВерсии(НомераТаблиц)
	
	// Элиминация ДКЗ в валюте Группы, т.к. в Группу попадает из(НЕ т.ЗаписьВДополнительнойВалюте)
	// сообщенная НРП в валюте отчета, чтобы пересчитать в валюту группы далее	 
	НомераТаблиц.Вставить("втВерсии", НомераТаблиц.Количество());
	
	Возврат 
	"ВЫБРАТЬ
	|	т.Ссылка КАК Версия,
	|	т.Регистратор КАК Регистратор,
	|	т.ВидОтчета КАК ВидОтчета,
	|	т.Валюта = &ФункциональнаяВалюта КАК ЭтоВО,
	|	т.ОсновнаяВерсия КАК ЭтоФВ,
	|	т.Организация КАК Организация
	|ПОМЕСТИТЬ втВерсии
	|ИЗ
	|	Справочник.ВерсииЗначенийПоказателей КАК т
	|ГДЕ
	|	т.Сценарий = &Сценарий
	|	И т.ВидОтчета В
	|			(ВЫБРАТЬ
	|				т.ВидОтчета
	|			ИЗ
	|				втПоказателиРазделовВГО КАК т)
	|	И т.Организация В(&ОрганизацииПериметра)
	|	И НЕ т.Организация.ЭлиминирующаяОрганизация
	|	И т.ПериодОтчета В (&ПериодОтчета)
	|	И НЕ т.ЧерноваяВерсия
	|	И НЕ т.Регистратор В
	|				(ВЫБРАТЬ
	|					т.Ссылка
	|				ИЗ
	|					РегистраторыИсключения КАК т)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	т.Ссылка,
	|	ЭтоФВ";	

КонецФункции

Функция ТекстЗапроса_втЗначенияПоказателейБезСубконто(НомераТаблиц)
	
	НомераТаблиц.Вставить("втЗначенияПоказателейБезСубконто", НомераТаблиц.Количество());
	
	ТекстЗапроса = Новый Массив;
	
	//ЗПО по Номерам: НомерРегистра, НомерКонтрагентИлиОрганизацияИлиНет, НомерСчет(не нужен для маржи)
	
	Шаблон = ШаблонЗапроса_ЗначенияПоказателейБезСубконто();
	Шаблон_Роль = Шаблон_Аналитика();
	Шаблон_Кор = Шаблон_АналитикаОбр();
		
	ПоляЗамены = Новый Структура(
		"ОрганизацияКонтрагент, Контрагент, ВидВыручкиВГО, Валюта, 
		|СчетБД, Подразделение, НаправлениеДеятельности,
		|КорСчетБД, КорПодразделение, КорНаправлениеДеятельности");
	ПоляКор = Новый Структура("КорСчетБД, КорПодразделение, КорНаправлениеДеятельности", Истина, Истина, Истина);
	
	Для каждого ПолеЗамены Из ПоляЗамены Цикл
		
		ЗаменяемПараметр = "&" + ПолеЗамены.Ключ;
		ТекШаблон = ?(ПоляКор.Свойство(ПолеЗамены.Ключ), Шаблон_Кор, Шаблон_Роль);
		НаРольПоШаблону = СтрШаблон(ТекШаблон, """" + ПолеЗамены.Ключ + """", "п.Роль");
		Шаблон = СтрЗаменить(Шаблон, ЗаменяемПараметр, НаРольПоШаблону);	
	
	КонецЦикла;
    
	Для НомерЗПО = 1 По 6 Цикл
		
		ШаблонЗПО = Строка(Шаблон);//копируем
		ШаблонЗПО = СтрЗаменить(ШаблонЗПО, "ЗначенияПоказателейОтчетов6", "ЗначенияПоказателейОтчетов" + НомерЗПО);
		ШаблонЗПО = СтрЗаменить(ШаблонЗПО, "&НомерРегистра", НомерЗПО);
		
		Для НомерАналитики = 1 По 6 Цикл
			Если НомерАналитики > НомерЗПО Тогда
				ШаблонЗПО = СтрЗаменить(ШаблонЗПО, "т.Аналитика" + НомерАналитики, "NULL");
			КонецЕсли;
		КонецЦикла;
		ТекстЗапроса.Добавить(ШаблонЗПО);
		
		Шаблон = СтрЗаменить(Шаблон, "ПОМЕСТИТЬ втЗначенияПоказателейБезСубконто", "");//
		
	КонецЦикла;
	
	Возврат СтрСоединить(ТекстЗапроса, " ОБЪЕДИНИТЬ ВСЕ ") + " ИНДЕКСИРОВАТЬ ПО Показатель";

КонецФункции
 
Функция ШаблонЗапроса_ЗначенияПоказателейБезСубконто()
	
	//ОрганизацияВГО мб: задана как "Контрагент.ОрганизационнаяЕдиница", и как "Организация"
	//ЦФО мб: "Контрагент.ОрганизационнаяЕдиница", и как "Организация"
	
	Возврат
	"ВЫБРАТЬ
	|	Версии.Организация КАК ОрганизацияОтчета,
	|	ЕСТЬNULL(МАКСИМУМ(ВЫРАЗИТЬ(&Контрагент КАК Справочник.Контрагенты).ОрганизационнаяЕдиница), МАКСИМУМ(&ОрганизацияКонтрагент)) КАК ОрганизацияКонтрагент,
	|	ЕСТЬNULL(МАКСИМУМ(&Валюта), МАКСИМУМ(т.АналитикаВалюта)) КАК Валюта,
	|	МАКСИМУМ(&СчетБД) КАК СчетБД,	
	|	МАКСИМУМ(&ВидВыручкиВГО) КАК ВидВыручкиВГО,
	|	МАКСИМУМ(&Подразделение) КАК Подразделение,
	|	МАКСИМУМ(&НаправлениеДеятельности) КАК НаправлениеДеятельности,
	|	МАКСИМУМ(&КорСчетБД) КАК КорСчетБД,
	|	МАКСИМУМ(&КорПодразделение) КАК КорПодразделение,
	|	МАКСИМУМ(&КорНаправлениеДеятельности) КАК КорНаправлениеДеятельности,
	|	МАКСИМУМ(т.Версия) КАК Версия,
	|	т.Показатель КАК Показатель,
	|	т.АналитикаВалюта КАК АналитикаВалюта,
	|	т.Аналитика1 КАК Аналитика1,
	|	т.Аналитика2 КАК Аналитика2,
	|	т.Аналитика3 КАК Аналитика3,
	|	т.Аналитика4 КАК Аналитика4,
	|	т.Аналитика5 КАК Аналитика5,
	|	т.Аналитика6 КАК Аналитика6,
	|	СУММА(т.ЗначениеВалюта) КАК ЗначениеВалюта,
	|	СУММА(т.Значение) КАК Значение
	|ПОМЕСТИТЬ втЗначенияПоказателейБезСубконто
	|ИЗ
	|	РегистрСведений.ЗначенияПоказателейОтчетов6 КАК т
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втПоказатели КАК п
	|		ПО т.Показатель = п.Показатель
	|			И (п.НомерРегистра = &НомерРегистра)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втВерсии КАК Версии
	|		ПО т.Версия = Версии.Версия
	|		И Версии.ЭтоВО
	|ГДЕ
	|	НЕ т.ИтоговоеЗначение
	|
	|СГРУППИРОВАТЬ ПО
	|	Версии.Организация,
	|	т.АналитикаВалюта,
	|	т.Аналитика1,
	|	т.Аналитика2,
	|	т.Аналитика3,
	|	т.Аналитика4,
	|	т.Аналитика5,
	|	т.Аналитика6,
	|	т.Показатель";

КонецФункции

Функция Шаблон_Аналитика()

	Возврат
	"ВЫБОР %(1)
	|		КОГДА %(2)1
	|			ТОГДА т.Аналитика1
	|		КОГДА %(2)2
	|			ТОГДА т.Аналитика2
	|		КОГДА %(2)3
	|			ТОГДА т.Аналитика3
	|		КОГДА %(2)4
	|			ТОГДА т.Аналитика4
	|		КОГДА %(2)5
	|			ТОГДА т.Аналитика5
	|		КОГДА %(2)6
	|			ТОГДА т.Аналитика6
	|	КОНЕЦ"	

КонецФункции

Функция Шаблон_АналитикаОбр()

	Возврат
	"ВЫБОР %(1)
	|		КОГДА %(2)6
	|			ТОГДА т.Аналитика6
	|		КОГДА %(2)5
	|			ТОГДА т.Аналитика5
	|		КОГДА %(2)4
	|			ТОГДА т.Аналитика4
	|		КОГДА %(2)3
	|			ТОГДА т.Аналитика3
	|		КОГДА %(2)2
	|			ТОГДА т.Аналитика2
	|		КОГДА %(2)1
	|			ТОГДА т.Аналитика1
	|	КОНЕЦ"	

КонецФункции

Функция ТекстЗапроса_втЗначенияПоказателей(НомераТаблиц)
	
	НомераТаблиц.Вставить("втЗначенияПоказателей", НомераТаблиц.Количество());
	
	Шаблон = Шаблон_Аналитика();
	
	ТекстЗапроса = ШаблонЗапроса_ЗначенияПоказателей();
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&Субконто1",		СтрШаблон(Шаблон, "ВЫРАЗИТЬ(Счет1.ТипДанных КАК СТРОКА(150))", "п.ПредставлениеТипа"));
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&Субконто2",		СтрШаблон(Шаблон, "ВЫРАЗИТЬ(Счет2.ТипДанных КАК СТРОКА(150))", "п.ПредставлениеТипа"));
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&Субконто3",		СтрШаблон(Шаблон, "ВЫРАЗИТЬ(Счет3.ТипДанных КАК СТРОКА(150))", "п.ПредставлениеТипа"));
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&КорСубконто1",	СтрШаблон(Шаблон, "ВЫРАЗИТЬ(КорСчет1.ТипДанных КАК СТРОКА(150))", "п.ПредставлениеТипа"));
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&КорСубконто2",	СтрШаблон(Шаблон, "ВЫРАЗИТЬ(КорСчет2.ТипДанных КАК СТРОКА(150))", "п.ПредставлениеТипа"));
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&КорСубконто3",	СтрШаблон(Шаблон, "ВЫРАЗИТЬ(КорСчет3.ТипДанных КАК СТРОКА(150))", "п.ПредставлениеТипа"));
	
	Возврат ТекстЗапроса;

КонецФункции

Функция ШаблонЗапроса_ЗначенияПоказателей()
	
	Возврат 
	"ВЫБРАТЬ
	|	т.ОрганизацияОтчета КАК ОрганизацияОтчета,
	|	т.ОрганизацияКонтрагент КАК ОрганизацияКонтрагент,
	|	т.ОрганизацияКонтрагент В (&ОрганизацииПериметра) КАК ЭтоКонтрагентВГО,
	|	т.ВидВыручкиВГО КАК ВидВыручкиВГО,
	|	т.Валюта КАК Валюта,
	|	т.СчетБД КАК СчетБД,
	|	т.Подразделение КАК Подразделение,
	|	т.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	т.КорСчетБД КАК КорСчетБД,
	|	т.КорПодразделение КАК КорПодразделение,
	|	т.КорНаправлениеДеятельности КАК КорНаправлениеДеятельности,
	|	т.Версия КАК Версия,
	|	т.Показатель КАК Показатель,
	|	т.АналитикаВалюта КАК АналитикаВалюта,
	|	т.Аналитика1 КАК Аналитика1,
	|	т.Аналитика2 КАК Аналитика2,
	|	т.Аналитика3 КАК Аналитика3,
	|	т.Аналитика4 КАК Аналитика4,
	|	т.Аналитика5 КАК Аналитика5,
	|	т.Аналитика6 КАК Аналитика6,
	|	&Субконто1 КАК Субконто1,
	|	&Субконто1 КАК Субконто2,
	|	&Субконто1 КАК Субконто3,
	|	&КорСубконто1 КАК КорСубконто1,
	|	&КорСубконто2 КАК КорСубконто2,
	|	&КорСубконто3 КАК КорСубконто3,
	|	т.ЗначениеВалюта КАК ЗначениеВалюта,
	|	т.Значение КАК Значение
	|ПОМЕСТИТЬ втЗначенияПоказателей
	|ИЗ
	|	втЗначенияПоказателейБезСубконто КАК т
	|		ЛЕВОЕ СОЕДИНЕНИЕ втПоказатели КАК п
	|		ПО т.Показатель = п.Показатель
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СчетаБД.ВидыСубконто КАК Счет1
	|		ПО т.СчетБД = Счет1.Ссылка
	|			И (Счет1.НомерСтроки = 1)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СчетаБД.ВидыСубконто КАК Счет2
	|		ПО т.СчетБД = Счет2.Ссылка
	|			И (Счет2.НомерСтроки = 2)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СчетаБД.ВидыСубконто КАК Счет3
	|		ПО т.СчетБД = Счет3.Ссылка
	|			И (Счет3.НомерСтроки = 3)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СчетаБД.ВидыСубконто КАК КорСчет1
	|		ПО т.КорСчетБД = КорСчет1.ВидСубконтоСсылка
	|			И (КорСчет1.НомерСтроки = 1)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СчетаБД.ВидыСубконто КАК КорСчет2
	|		ПО т.КорСчетБД = КорСчет2.ВидСубконтоСсылка
	|			И (КорСчет2.НомерСтроки = 2)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СчетаБД.ВидыСубконто КАК КорСчет3
	|		ПО т.КорСчетБД = КорСчет3.ВидСубконтоСсылка
	|			И (КорСчет3.НомерСтроки = 3)
	|ГДЕ
	|	т.Значение <> 0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Показатель";

КонецФункции

#КонецОбласти

#Область Трансляция

Функция ТекстЗапроса_втСчетаПоказателей(НомераТаблиц)
	
	НомераТаблиц.Вставить("втСчетаПоказателей", НомераТаблиц.Количество());
	
	Возврат
	"ВЫБРАТЬ
	|	NULL КАК Подразделение,
	|	NULL КАК НаправлениеДеятельности,
	|	ВЫБОР вс1.ВидСубконтоСсылка
	|		КОГДА т.ГруппаРаскрытия.ВидАналитики1
	|			ТОГДА 1
	|		КОГДА т.ГруппаРаскрытия.ВидАналитики2
	|			ТОГДА 2
	|		КОГДА т.ГруппаРаскрытия.ВидАналитики3
	|			ТОГДА 3
	|		КОГДА т.ГруппаРаскрытия.ВидАналитики4
	|			ТОГДА 4
	|		КОГДА т.ГруппаРаскрытия.ВидАналитики5
	|			ТОГДА 5
	|		КОГДА т.ГруппаРаскрытия.ВидАналитики6
	|			ТОГДА 6
	|	КОНЕЦ КАК Субконто1,
	|	ВЫБОР вс2.ВидСубконтоСсылка
	|		КОГДА т.ГруппаРаскрытия.ВидАналитики1
	|			ТОГДА 1
	|		КОГДА т.ГруппаРаскрытия.ВидАналитики2
	|			ТОГДА 2
	|		КОГДА т.ГруппаРаскрытия.ВидАналитики3
	|			ТОГДА 3
	|		КОГДА т.ГруппаРаскрытия.ВидАналитики4
	|			ТОГДА 4
	|		КОГДА т.ГруппаРаскрытия.ВидАналитики5
	|			ТОГДА 5
	|		КОГДА т.ГруппаРаскрытия.ВидАналитики6
	|			ТОГДА 6
	|	КОНЕЦ КАК Субконто2,
	|	ВЫБОР вс3.ВидСубконтоСсылка
	|		КОГДА т.ГруппаРаскрытия.ВидАналитики1
	|			ТОГДА 1
	|		КОГДА т.ГруппаРаскрытия.ВидАналитики2
	|			ТОГДА 2
	|		КОГДА т.ГруппаРаскрытия.ВидАналитики3
	|			ТОГДА 3
	|		КОГДА т.ГруппаРаскрытия.ВидАналитики4
	|			ТОГДА 4
	|		КОГДА т.ГруппаРаскрытия.ВидАналитики5
	|			ТОГДА 5
	|		КОГДА т.ГруппаРаскрытия.ВидАналитики6
	|			ТОГДА 6
	|	КОНЕЦ КАК Субконто3,
	|	т.Показатель КАК Показатель,
	|	т.СчетБД КАК СчетИсточник
	|ПОМЕСТИТЬ втСчетаПоказателей
	|ИЗ
	|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		п.Показатель КАК Показатель,
	|		ВЫРАЗИТЬ(п.Показатель.ГруппаРаскрытия КАК Справочник.ГруппыРаскрытия) КАК ГруппаРаскрытия,
	|		п.СчетБД КАК СчетБД
	|	ИЗ
	|		втЗначенияПоказателей КАК п) КАК т
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СчетаБД.ВидыСубконто КАК вс1
	|		ПО т.СчетБД = вс1.Ссылка
	|			И (вс1.НомерСтроки = 1)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СчетаБД.ВидыСубконто КАК вс2
	|		ПО т.СчетБД = вс2.Ссылка
	|			И (вс2.НомерСтроки = 2)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СчетаБД.ВидыСубконто КАК вс3
	|		ПО т.СчетБД = вс3.Ссылка
	|			И (вс3.НомерСтроки = 3)";

КонецФункции

Функция ТекстЗапроса_СчетаДляТрансляции()
	
	Возврат
	"ВЫБРАТЬ
	|	т.СчетИсточник КАК СчетИсточник
	|ИЗ
	|	втСчетаПоказателей КАК т";

КонецФункции

Процедура ДобавитьЗапросы_втОборотыТрансляции(ТекстЗапроса, НомераТаблиц, Запрос)
	
	Процессор = МСФОЗапросыУХ.НовыйПроцессорТрансляцииЗапросом(Запрос.Параметры.ШаблонТрансляции);
	
	//Процессор.ПутиИсключения.Добавить("Регистратор");
	Процессор.ИмяТаблицыИсточника = "ТаблицаИсточник";
	
	Процессор.СтороныТрансляции.Вставить("Трансляция", Истина); //Истина=Дебет
	
	Процессор.ПоляИсточники.Вставить("Регистратор", "Версия.Регистратор");
	Процессор.ПоляИсточники.Вставить("Организация", "ОрганизацияОтчета");

	ПараметрыЗамены = МСФОЗапросыУХ.ПодготовитьЗаменыПараметровТрансляции(Процессор);
	
	МСФОЗапросыУХ.ДобавитьЗапросыТрансляции(ТекстЗапроса, НомераТаблиц, ТекстЗапроса_СчетаДляТрансляции());
	Шаблон = ТекстЗапроса_втЗначенияПоказателейОттранслированные(НомераТаблиц);
	ТекстЗапроса.Добавить(МСФОЗапросыУХ.ЗаменитьПараметрыЗапроса(Шаблон, ПараметрыЗамены));

КонецПроцедуры

Функция ТекстЗапроса_втЗначенияПоказателейОттранслированные(НомераТаблиц)

	НомераТаблиц.Вставить("втЗначенияПоказателейОттранслированные", НомераТаблиц.Количество());
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ТаблицаИсточник.Показатель КАК Показатель,
	|	&Трансляция_Подразделение КАК Подразделение,
	|	&Трансляция_НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	&Трансляция_Субконто1 КАК Субконто1,
	|	&Трансляция_Субконто2 КАК Субконто2,
	|	&Трансляция_Субконто3 КАК Субконто3,
	|	ЕСТЬNULL(втТрансляция.СчетПриемник, ТаблицаИсточник.СчетБД) КАК СчетБД,
	|	ТаблицаИсточник.СчетБД КАК СчетИсточник
	|ПОМЕСТИТЬ втЗначенияПоказателейОттранслированные
	|ИЗ
	|	втЗначенияПоказателей КАК ТаблицаИсточник
	|		ЛЕВОЕ СОЕДИНЕНИЕ втПравилаПолей КАК втТрансляция
	|		ПО ТаблицаИсточник.СчетБД = втТрансляция.СчетИсточник
	|			И (&Трансляция_Отбор)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ТаблицаИсточник.Показатель";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ТаблицаИсточник.Показатель КАК Показатель", "*");
	
	Возврат ТекстЗапроса; 
	
КонецФункции

#КонецОбласти

#Область Маржа

Функция ТекстЗапроса_втСебестоимость(НомераТаблиц)
	
	//-себестоимость может быть в разрезе контрагентов или нет
	//-себестоимость может быть в разрезе видов выручки(номенклатуры, или других активов) или нет
	//-одна ФСД себестоимости может использоваться в нескольких разделах сверки
	//-по одному виду выручки может быть разные аналитики
	
	//ПокупательРасчетМаржи, ВидВыручкиРасчетМаржи = если не используется, то "NULL"
	
	НомераТаблиц.Вставить("втСебестоимостьПоРазделамВГО", НомераТаблиц.Количество());
	
	Возврат 
	"ВЫБРАТЬ
	|	втРазделыВГО.РазделВГО КАК РазделВГО,
	|	втЗначенияПоказателей.ОрганизацияОтчета КАК Продавец,
	|	втЗначенияПоказателей.ОрганизацияКонтрагент КАК ПокупательРасчетМаржи,
	|	втЗначенияПоказателей.ВидВыручкиВГО КАК ВидВыручкиРасчетМаржи,
	|	СУММА(втЗначенияПоказателей.Значение) КАК Себестоимость
	|ПОМЕСТИТЬ втСебестоимостьПоРазделамВГО
	|ИЗ
	|	втПоказателиРазделовВГО КАК втРазделыВГО
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втЗначенияПоказателей КАК втЗначенияПоказателей
	|		ПО втРазделыВГО.Показатель = втЗначенияПоказателей.Показатель
	|			И (втРазделыВГО.ЭтоСебестоимостьПродавца)
	|
	|СГРУППИРОВАТЬ ПО
	|	втРазделыВГО.РазделВГО,
	|	втЗначенияПоказателей.ОрганизацияОтчета,
	|	втЗначенияПоказателей.ОрганизацияКонтрагент,
	|	втЗначенияПоказателей.ВидВыручкиВГО
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Продавец,
	|	РазделВГО,
	|	ПокупательРасчетМаржи,
	|	ВидВыручкиРасчетМаржи";

КонецФункции

//упрощенно: Маржа = (Выручка - Себестоимость) / Выручка
Функция ТекстЗапроса_втМаржа(НомераТаблиц)
	
	//Д=доходы(ФСД выручка продавца), Р=расходы(ФСД себестоимость продавца), П=показатель покупателя(ФСД закупки покупателя)
	//ФСД мб по Контрагенту(К), НоменклатурнойГруппе/ВидВыручки(НГ)
	//Аналитика	маржи:
	//а)П(НГ,К), Д(НГ,К), Р(НГ): по маржа НГ без К(Д(НГ), Р(НГ))
	//б)П(НГ,К), Д(НГ,К), Р(НГ,К): по маржа НГ+К
	//в)П(НГ,К), Д(НГ,К), Р(): по маржа общая(Д(-),Р(-))
	
	НомераТаблиц.Вставить("втМаржа", НомераТаблиц.Количество());
	
	Возврат 
	"ВЫБРАТЬ
	|	втРазделыВГО.РазделВГО КАК РазделВГО,
	|	ВыручкаПродавца.ОрганизацияОтчета КАК Продавец,
	|	СебестоимостьПродавца.ПокупательРасчетМаржи КАК ПокупательРасчетМаржи,
	|	СебестоимостьПродавца.ВидВыручкиРасчетМаржи КАК ВидВыручкиРасчетМаржи,
	|	ВЫБОР
	|		КОГДА СУММА(ВыручкаПродавца.Значение) <> 0
	|			ТОГДА (СУММА(ВыручкаПродавца.Значение) - МАКСИМУМ(СебестоимостьПродавца.Себестоимость)) / СУММА(ВыручкаПродавца.Значение)
	|	КОНЕЦ КАК Маржа
	|ПОМЕСТИТЬ втМаржа
	|ИЗ
	|	втЗначенияПоказателей КАК ВыручкаПродавца
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втПоказателиРазделовВГО КАК втРазделыВГО
	|		ПО ВыручкаПродавца.Показатель = втРазделыВГО.Показатель
	|			И (втРазделыВГО.ЭтоЗапасыПокупателя)
	|		ЛЕВОЕ СОЕДИНЕНИЕ втСебестоимостьПоРазделамВГО КАК СебестоимостьПродавца
	|		ПО ВыручкаПродавца.ОрганизацияОтчета = СебестоимостьПродавца.Продавец
	|			И (втРазделыВГО.РазделВГО = СебестоимостьПродавца.РазделВГО)
	|			И (ВыручкаПродавца.ОрганизацияКонтрагент = ЕСТЬNULL(СебестоимостьПродавца.ПокупательРасчетМаржи, ВыручкаПродавца.ОрганизацияКонтрагент))
	|			И (ВыручкаПродавца.ВидВыручкиВГО = ЕСТЬNULL(СебестоимостьПродавца.ВидВыручкиРасчетМаржи, ВыручкаПродавца.ВидВыручкиВГО))
	|
	|СГРУППИРОВАТЬ ПО
	|	втРазделыВГО.РазделВГО,
	|	ВыручкаПродавца.ОрганизацияОтчета,
	|	СебестоимостьПродавца.ПокупательРасчетМаржи,
	|	СебестоимостьПродавца.ВидВыручкиРасчетМаржи
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Продавец,
	|	РазделВГО,
	|	ПокупательРасчетМаржи,
	|	ВидВыручкиРасчетМаржи";	

КонецФункции

#КонецОбласти

#Область ЗапросыДвижений

Функция ТекстЗапроса_Проводки(НомераТаблиц, ФормироватьПроводкиМСФО = Ложь)
	
	Если Ложь И ФормироватьПроводкиМСФО Тогда
		НомераТаблиц.Вставить("ТаблицаМСФО", НомераТаблиц.Количество());
	Иначе	
		НомераТаблиц.Вставить("ТаблицаПроводок", НомераТаблиц.Количество());
	КонецЕсли;
	
	Шаблон = """ + %1 + """;

	ДляКомментария = Новый Структура;
	ДляКомментария.Вставить("Показатель", 	СтрШаблон(Шаблон, "втПоказателиРазделовВГО.Показатель.Наименование"));
	ДляКомментария.Вставить("ВидОтчета", 	СтрШаблон(Шаблон, "втПоказателиРазделовВГО.Показатель.Владелец.Наименование"));
	ДляКомментария.Вставить("РазделСверки", СтрШаблон(Шаблон, "втПоказателиРазделовВГО.РазделВГО.Наименование"));
	ДляКомментария.Вставить("Организация", 	СтрШаблон(Шаблон, "т.ОрганизацияОтчета.Наименование"));
	ДляКомментария.Вставить("Контрагент", 	СтрШаблон(Шаблон, "т.ОрганизацияКонтрагент.Наименование"));
		
	ТекстЗапроса = Новый Массив;
    ТекстЗапроса.Добавить(ТекстЗапроса_ПроводкаСторноВыручкиПродавца(ДляКомментария));
	ТекстЗапроса.Добавить(ТекстЗапроса_ПроводкаСторноЗакупкиПокупателя(ДляКомментария));
	ТекстЗапроса.Добавить(ТекстЗапроса_ПроводкаКорректировкаЗапасовПокупателя(ДляКомментария));
	
	Возврат СтрСоединить(ТекстЗапроса, " ОБЪЕДИНИТЬ ВСЕ ");

КонецФункции

//Дт 000 Кт 90.01 = - ВыручкаПродавца
Функция ТекстЗапроса_ПроводкаСторноВыручкиПродавца(ДляКомментария)
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	""&Комментарий"" КАК Событие,
	|	т.Валюта КАК ВалютаДт,
	|	т.Валюта КАК ВалютаКт,
	|	втРегламенты.Счет КАК СчетДт,
	|	т.Подразделение КАК ПодразделениеДт,
	|	т.НаправлениеДеятельности КАК НаправлениеДеятельностиДт,
	|	&ТехСубконто1 КАК СубконтоДт1,
	|	&ТехСубконто2 КАК СубконтоДт2,
	|	&ТехСубконто3 КАК СубконтоДт3,
	|	т.СчетБД КАК СчетКт,
	|	т.Подразделение КАК ПодразделениеКт,
	|	т.НаправлениеДеятельности КАК НаправлениеДеятельностиКт,
	|	т.Субконто1 КАК СубконтоКт1,
	|	т.Субконто2 КАК СубконтоКт2,
	|	т.Субконто3 КАК СубконтоКт3,
	|	втРегламенты.Счет КАК СчетДтИсточник,
	|	т.СчетИсточник КАК СчетКтИсточник,
	|	-т.ЗначениеВалюта КАК СуммаВВалютеДт,
	|	-т.ЗначениеВалюта КАК СуммаВВалютеКт,
	|	-т.Значение КАК СуммаВФункциональнойВалюте
	|ИЗ
	|	втЗначенияПоказателейОттранслированные КАК т
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втПоказателиРазделовВГО КАК втПоказателиРазделовВГО
	|		ПО т.Показатель = втПоказателиРазделовВГО.Показатель
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втРегламенты КАК втРегламенты
	|		ПО (ИСТИНА)
	|ГДЕ
	|	втПоказателиРазделовВГО.ЭтоПродавец 
	|	И т.ЭтоКонтрагентВГО";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТехСубконто1", Шаблон_СубконтоТехСчета(1));
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТехСубконто2", Шаблон_СубконтоТехСчета(2));
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТехСубконто3", Шаблон_СубконтоТехСчета(3));
	
	Комментарий = 
	НСтр("ru = 'Сторно выручки у продавца. 
	|Показатель выручки <[Показатель]> ([ВидОтчета]) из <[РазделСверки]>.
	|По <[Организация]> с <[Контрагент]>'", 
	ОбщегоНазначения.КодОсновногоЯзыка());
	
	Возврат СтрЗаменить(ТекстЗапроса, "&Комментарий", КомментарийПроводки(Комментарий, ДляКомментария));
	
КонецФункции

//Дт 90.02 Кт 000 = - ЗакупкаПокупателя (только если нет себестоимости, см. втИдРазделовВГО+ЕстьЗапасы)
Функция ТекстЗапроса_ПроводкаСторноЗакупкиПокупателя(ДляКомментария)
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	""&Комментарий"" КАК Событие,
	|	т.Валюта КАК ВалютаДт,
	|	т.Валюта КАК ВалютаКт,
	|	т.СчетБД КАК СчетДт,
	|	т.Подразделение КАК ПодразделениеДт,
	|	т.НаправлениеДеятельности КАК НаправлениеДеятельностиДт,
	|	т.Аналитика1 КАК СубконтоДт1,
	|	т.Аналитика2 КАК СубконтоДт2,
	|	т.Аналитика3 КАК СубконтоДт3,
	|	втРегламенты.Счет КАК СчетКт,
	|	т.Подразделение КАК ПодразделениеКт,
	|	т.НаправлениеДеятельности КАК НаправлениеДеятельностиКт,
	|	&ТехСубконто1 КАК СубконтоКт1,
	|	&ТехСубконто2 КАК СубконтоКт2,
	|	&ТехСубконто3 КАК СубконтоКт3,
	|	т.СчетИсточник КАК СчетДтИсточник,
	|	втРегламенты.Счет КАК СчетКтИсточник,
	|	-т.ЗначениеВалюта КАК СуммаВВалютеДт,
	|	-т.ЗначениеВалюта КАК СуммаВВалютеКт,
	|	-т.Значение КАК Значение
	|ИЗ
	|	втЗначенияПоказателейОттранслированные КАК т
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втПоказателиРазделовВГО КАК втПоказателиРазделовВГО
	|		ПО т.Показатель = втПоказателиРазделовВГО.Показатель
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втРегламенты КАК втРегламенты
	|		ПО (ИСТИНА)
	|ГДЕ
	|	втПоказателиРазделовВГО.ЭтоПокупатель И т.ЭтоКонтрагентВГО";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТехСубконто1", Шаблон_СубконтоТехСчета(1));
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТехСубконто2", Шаблон_СубконтоТехСчета(2));
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТехСубконто3", Шаблон_СубконтоТехСчета(3));
	
	Комментарий = 
	НСтр("ru = 'Сторно закупки у покупателя. 
	|Показатель закупки <[Показатель]> ([ВидОтчета]) из <[РазделСверки]>.
	|По <[Организация]> с <[Контрагент]>'", 
	ОбщегоНазначения.КодОсновногоЯзыка());
	
	Возврат СтрЗаменить(ТекстЗапроса, "&Комментарий", КомментарийПроводки(Комментарий, ДляКомментария));
	
КонецФункции

//Дт 10.01 Кт 000 = - ЗакупкаПокупателя * Маржа
Функция ТекстЗапроса_ПроводкаКорректировкаЗапасовПокупателя(ДляКомментария)
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	""&Комментарий"" КАК Событие,
	|	т.Валюта КАК ВалютаДт,
	|	т.Валюта КАК ВалютаКт,
	|	т.СчетБД КАК СчетДт,
	|	т.Подразделение КАК ПодразделениеДт,
	|	т.НаправлениеДеятельности КАК НаправлениеДеятельностиДт,
	|	т.Аналитика1 КАК СубконтоДт1,
	|	т.Аналитика2 КАК СубконтоДт2,
	|	т.Аналитика3 КАК СубконтоДт3,
	|	втРегламенты.Счет КАК СчетКт,
	|	т.Подразделение КАК ПодразделениеКт,
	|	т.НаправлениеДеятельности КАК НаправлениеДеятельностиКт,
	|	&ТехСубконто1 КАК СубконтоКт1,
	|	&ТехСубконто2 КАК СубконтоКт2,
	|	&ТехСубконто3 КАК СубконтоКт3,
	|	т.СчетИсточник КАК СчетДтИсточник,
	|	втРегламенты.Счет КАК СчетКтИсточник,
	|	-т.ЗначениеВалюта * втМаржа.Маржа КАК СуммаВВалютеДт,
	|	-т.ЗначениеВалюта * втМаржа.Маржа КАК СуммаВВалютеКт,
	|	-т.Значение * втМаржа.Маржа КАК Значение
	|ИЗ
	|	втЗначенияПоказателейОттранслированные КАК т
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втПоказателиРазделовВГО КАК втПоказателиРазделовВГО
	|		ПО т.Показатель = втПоказателиРазделовВГО.Показатель
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втРегламенты КАК втРегламенты
	|		ПО (ИСТИНА)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втМаржа КАК втМаржа
	|		ПО т.Показатель = втМаржа.Продавец
	|			И (т.ОрганизацияКонтрагент = ЕСТЬNULL(втМаржа.ПокупательРасчетМаржи, т.ОрганизацияКонтрагент))
	|			И (т.ВидВыручкиВГО = ЕСТЬNULL(втМаржа.ВидВыручкиРасчетМаржи, т.ВидВыручкиВГО))
	|ГДЕ
	|	втПоказателиРазделовВГО.ЭтоПокупатель
	|	И т.ЭтоКонтрагентВГО";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТехСубконто1", Шаблон_СубконтоТехСчета(1));
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТехСубконто2", Шаблон_СубконтоТехСчета(2));
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТехСубконто3", Шаблон_СубконтоТехСчета(3));
	
	Комментарий = 
	НСтр("ru = 'Корректировка закупки у покупателя на маржу продавца. 
	|Показатель закупки <[Показатель]> ([ВидОтчета]) из <[РазделСверки]>.
	|По <[Организация]> с <[Контрагент]>'", 
	ОбщегоНазначения.КодОсновногоЯзыка());
	
	Возврат СтрЗаменить(ТекстЗапроса, "&Комментарий", КомментарийПроводки(Комментарий, ДляКомментария));
	
КонецФункции

Функция КомментарийПроводки(Комментарий, ДляКомментария)
	Возврат СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(Комментарий, ДляКомментария);
КонецФункции

Функция Шаблон_СубконтоТехСчета(НомерСубконто = 1)
	
	//**контрагент
	Результат =
	"ВЫБОР
	|		КОГДА втРегламенты.Субконто%1 <> НЕОПРЕДЕЛЕНО
	|			ТОГДА втРегламенты.Субконто%1
	|		КОГДА втРегламенты.Роль%1 = ""ОрганизацияКонтрагент""
	|			ТОГДА т.ОрганизацияОтчета
	|		КОГДА втРегламенты.Роль%1 = ""РазделВГО""
	|			ТОГДА втПоказателиРазделовВГО.РазделВГО
	|		КОГДА втРегламенты.Роль%1 = ""ПоказательОтчета""
	|			ТОГДА т.Показатель
	|	КОНЕЦ";
	
	Возврат СтрШаблон(Результат, НомерСубконто);

КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
